Revit 2024 API
BuiltInFailures.ConnectorFailures.ShapesNotMatch Property
 Shapes do not match. A connection could not be made.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ShapesNotMatch { get; }
Visual Basic
Public Shared ReadOnly Property ShapesNotMatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ShapesNotMatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace